---
kind: enumMember
id: F:Autodesk.Revit.DB.ViewPlacementOnSheetStatus.NotApplicable
enum: Autodesk.Revit.DB.ViewPlacementOnSheetStatus
source: html/f05c1c2c-b8d6-b9f3-d96c-bf24f5f0f6bf.htm
---
# Autodesk.Revit.DB.ViewPlacementOnSheetStatus.NotApplicable

The View cannot be placed on Sheet.